app/controllers/actresses_controller.rb

  def index
    @actresses = Actress.all
---
SELECT `actresses`.* FROM `actresses`

  def show
    @actress = Actress.find(params[:id])
---
SELECT `actresses`.* FROM `actresses` WHERE `actresses`.`id` = 1 LIMIT 1

  def edit
    @actress = Actress.find(params[:id])
---
SELECT `actresses`.* FROM `actresses` WHERE `actresses`.`id` = 46 LIMIT 1

  def create

    @actress = Actress.new( params[:actress] )
    @actress.photo1 = @actress.photo1.read
    respond_to do |format|
      if @actress.save
---
INSERT INTO `actresses` (`birthday`, `created_at`, `id`, `name`, `office_id`, `photo1`, `photo2`, `photo3`, `profile`, `sex`, `updated_at`) VALUES ('1987-08-30', '2012-12-12 17:12:32', 38, 'fdsafdsafdsa', NULL, x'686f6765', x'686f6765', x'6e756c6c6c6c', '', 1, '2012-12-12 17:12:32')

  def update
    @actress = Actress.find(params[:id])

    respond_to do |format|
      if @actress.update_attributes(params[:actress])
---
SELECT `actresses`.* FROM `actresses` WHERE `actresses`.`id` = 46 LIMIT 1
UPDATE `actresses` SET `birthday` = '2012-12-24', `updated_at` = '2012-12-24 06:02:51' WHERE `actresses`.`id` = 46

  def destroy
    @actress = Actress.find(params[:id])
    @actress.destroy
---
SELECT `actresses`.* FROM `actresses` WHERE `actresses`.`id` = 1 LIMIT 1
DELETE FROM `actresses` WHERE `actresses`.`id` = 1