app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
			#んでindexがゲストユーザtopになるかな？
    @users = User.all #ここでviewに渡す値を定義する。

SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---
  def show
    @user = User.find(params[:id])

INSERT INTO `users` (`created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `last_login`, `last_sign_in_at`, `last_sign_in_ip`, `name`, `password`, `provider`, `remember_created_at`, `reset_password_sent_at`, `reset_password_token`, `sign_in_count`, `type`, `uid`, `updated_at`) VALUES ('2012-12-03 12:36:41', NULL, NULL, 'fdafdafdsaasafdasfdsaf@ho.com', '$2a$10$tbv8oXY7UMp9M0f.8UY2GuZwsivX0g303LExqp6LMjm11QhS527x2', NULL, NULL, NULL, 'fdafd', NULL, NULL, NULL, NULL, NULL, 0, NULL, NULL, '2012-12-03 12:36:41')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save